# Direct Context 3DHandle Settings Class

Source: https://www.revitapidocs.com/2026/cc9d7b07-a4d9-8570-9ed8-c953e241c0d6.htm

---

| Direct Context 3DHandle Settings Class |
| --- |

Overriding settings applied to DirectContext3DHandles through the Visibility dialog. Inheritance Hierarchy System Object
Autodesk.Revit.DB.DirectContext3D DirectContext3DHandleSettings

**Namespace:** Autodesk.Revit.DB.DirectContext3D
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class DirectContext3DHandleSettings : IDisposable
```

```
Public Class DirectContext3DHandleSettings
	Implements IDisposable
```

```
public ref class DirectContext3DHandleSettings : IDisposable
```

```
type DirectContext3DHandleSettings =
    class
        interface IDisposable
    end
```
The DirectContext3DHandleSettings type exposes the following members.

Constructors

|  | Name | Description |
| --- | --- | --- |
|  | DirectContext3DHandleSettings | Constructs an instance of settings with default values. |
|  | DirectContext3DHandleSettings(DirectContext3DHandleSettings) | Constructs a copy of source object. |
|  | DirectContext3DHandleSettings(Boolean, Int32\) | Constructs an instance of settings with provided values. |

Top Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Visibility | Visibility of the handle and the associated DirectContext3D graphics.  A value of true means that the graphics are visible. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Assign | Assigns values of the source settings to this object. |
|  | Dispose | Releases all resources used by the DirectContext3DHandleSettings |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetColor | Gets the color of the handle and the associated DirectContext3D graphics. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetTransparency | Gets the transparency value of the handle and the associated DirectContext3D graphics. |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | IsEqual | Check if the contents of two instances of settings are equal. |
|  | SetColor | Sets the color of the handle and the associated DirectContext3D graphics. |
|  | SetTransparency | Sets the transparency value of the handle and the associated DirectContext3D graphics. |
|  | SetVisibility | Visibility of the handle and the associated DirectContext3D graphics.  A value of true means that the graphics are visible. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top Remarks DirectContext3D graphics can be displayed with or without an associated DirectContext3D handle
 element. For DirectContext3D graphics that utilize the handle element, the visibility and appearance of
 the graphics can be adjusted through the Visibility/Graphics dialog.

See Also

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace